КанцОптТорг/src/Documents/ЗакрытиеМесяца/ЗакрытиеМесяца.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗакрытиеМесяца</name>
  <registerRecords>AccountingRegister.РегистрыБухУчёт</registerRecords>
</mdclass:Document>

КанцОптТорг/src/AccountingRegisters/РегистрыБухУчёт/РегистрыБухУчёт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>РегистрыБухУчёт</name>
  <chartOfAccounts>ChartOfAccounts.БухУчёт</chartOfAccounts>
  <correspondence>true</correspondence>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
  </resources>
</mdclass:AccountingRegister>

КанцОптТорг/src/ChartsOfAccounts/БухУчёт/БухУчёт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>БухУчёт</name>
  <predefined>
    <items>
      <name>Товары</name>
      <description>Товары</description>
      <code>41       </code>
    </items>
    <items>
      <name>РасчётыСПоставщиками</name>
      <description>Расчёты с поставщиками</description>
      <code>60       </code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>Себестоимость</name>
      <description>Себестоимость</description>
      <code>90.1     </code>
    </items>
    <items>
      <name>РасчётыСПокупателями</name>
      <description>Расчёты с покупателями</description>
      <code>62       </code>
    </items>
    <items>
      <name>Выручка</name>
      <description>Выручка</description>
      <code>90.2     </code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>Касса</name>
      <description>Касса</description>
      <code>50       </code>
    </items>
    <items>
      <name>РасчётныеСчета</name>
      <description>Расчётные счета</description>
      <code>51       </code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>ПрибылиИУбытки</name>
      <description>Прибыли и убытки</description>
      <code>99       </code>
      <accountType>Passive</accountType>
    </items>
  </predefined>
</mdclass:ChartOfAccounts>

КанцОптТорг/src/Documents/ЗакрытиеМесяца/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РегистрыБухУчётОстатки.Счет,
		|	РегистрыБухУчётОстатки.СуммаОстатокДт,
		|	РегистрыБухУчётОстатки.СуммаОстатокКт
		|ИЗ
		|	РегистрБухгалтерии.РегистрыБухУчёт.Остатки(&МоментВремени, Счет В (&СчётВыручка, &СчётСебестоимость),) КАК
		|		РегистрыБухУчётОстатки";
	
	Запрос.УстановитьПараметр("СчётВыручка", ПланыСчетов.БухУчёт.Выручка);
	Запрос.УстановитьПараметр("СчётСебестоимость", ПланыСчетов.БухУчёт.Себестоимость);
	Запрос.УстановитьПараметр("МоментВремени", КонецМесяца(Дата)+1);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СуммаВыручки = 0;
	СуммаСебестоимости = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.Счёт = ПланыСчетов.БухУчёт.Выручка Тогда
			СуммаВыручки = ВыборкаДетальныеЗаписи.СуммаОстатокКт;
		ИначеЕсли ВыборкаДетальныеЗаписи.Счёт = ПланыСчетов.БухУчёт.Себестоимость Тогда
			СуммаСебестоимости = ВыборкаДетальныеЗаписи.СуммаОстатокДт;
			КонецЕсли;
		
	КонецЦикла;
	
	Движения.РегистрыБухУчёт.Записывать = Истина;
	
	Проводка = Движения.РегистрыБухУчёт.Добавить();
	Проводка.Период = Дата;
	Проводка.СчетДт = ПланыСчетов.БухУчёт.Выручка;
	Проводка.СчетКт = ПланыСчетов.БухУчёт.ПрибылиИУбытки;
	Проводка.Сумма = СуммаВыручки;
	
	Проводка = Движения.РегистрыБухУчёт.Добавить();
	Проводка.Период = Дата;
	Проводка.СчетДт = ПланыСчетов.БухУчёт.ПрибылиИУбытки;
	Проводка.СчетКт = ПланыСчетов.БухУчёт.Себестоимость;
	Проводка.Сумма = СуммаСебестоимости;
	КонецПроцедуры
